app/views/shared/_user_info.html.erb

<span>
  <%= pluralize(current_user.menus.count, "menu") %>
---
SELECT COUNT(*) FROM "menus"  WHERE "menus"."user_id" = $1  [["user_id", 2]]