app/controllers/main_controller.rb

  def index
  	@menus = Menu.paginate(page: params[:page])
---
SELECT  "menus".* FROM "menus"   ORDER BY created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "menus"