app/controllers/menus_controller.rb

  def index
    @menus = Menu.paginate(page: params[:page])
    @menu = current_user.menus.build

    @levels = Level.all
    @categories = Category.all
---
SELECT  "menus".* FROM "menus"   ORDER BY created_at DESC LIMIT 30 OFFSET 0
SELECT "levels".* FROM "levels"
SELECT "categories".* FROM "categories"

  def create
    @levels = Level.all
    @categories = Category.all
    @menu = current_user.menus.new(menu_params) do |t|
      uploaded_io = params[:menu][:image]

      if params[:menu][:image]
        File.open(Rails.root.join('public', 'uploads', uploaded_io.original_filename), 'wb') do |file|
          file.write(uploaded_io.read)
          t.filename = uploaded_io.original_filename
          t.mime_type = uploaded_io.content_type
        end
      end
    end

    if @menu.save
---
SELECT "levels".* FROM "levels"
SELECT "categories".* FROM "categories"
INSERT INTO "menus" ("category_id", "cooking_time", "created_at", "description", "filename", "ingredient", "level_id", "mime_type", "preparation", "serve", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def show
    @menu = Menu.find(params[:id])
    @level = Level.find(@menu.level_id)
    @category = Category.find(@menu.category_id)
    @user = User.find(@menu.user_id)
---
SELECT  "menus".* FROM "menus"  WHERE "menus"."id" = $1  ORDER BY created_at DESC LIMIT 1  [["id", 1]]
SELECT  "levels".* FROM "levels"  WHERE "levels"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = $1 LIMIT 1  [["id", 5]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]