app/controllers/resipi_controller.rb

	def index
		@resipi = Resipi.all
---
SELECT "resipis".* FROM "resipis"

	def create
		@resipi = Resipi.new(resipi_params) do |t|
			uploaded_io = params[:resipi][:image]

			if params[:resipi][:image]
				File.open(Rails.root.join('public', 'uploads', uploaded_io.original_filename), 'wb') do |file|
		    		file.write(uploaded_io.read)
		    		t.filename = uploaded_io.original_filename
		    		t.mime_type = uploaded_io.content_type
		    	end
		    end
		end

		if @resipi.save
---
INSERT INTO "resipis" ("created_at", "filename", "mime_type", "text", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

	def edit
		@resipi = Resipi.find(params[:id])
---
SELECT  "resipis".* FROM "resipis"  WHERE "resipis"."id" = $1 LIMIT 1  [["id", 3]]

	def show
		@resipi = Resipi.find(params[:id])
---
SELECT  "resipis".* FROM "resipis"  WHERE "resipis"."id" = $1 LIMIT 1  [["id", 1]]

	def destroy
		@resipi = Resipi.find(params[:id])
		@resipi.destroy
---
SELECT  "resipis".* FROM "resipis"  WHERE "resipis"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "resipis" WHERE "resipis"."id" = $1  [["id", 3]]