app/controllers/users_controller.rb

  def show
  	@user = User.find(params[:id])
    @menus = @user.menus.paginate(page: params[:page])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "menus".* FROM "menus"  WHERE "menus"."user_id" = $1  ORDER BY created_at DESC LIMIT 30 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "menus"  WHERE "menus"."user_id" = $1  [["user_id", 1]]

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "remember_token", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    if @user.update_attributes(user_params)
---
UPDATE "users" SET "intro" = $1, "location" = $2, "password_digest" = $3, "updated_at" = $4, "url" = $5 WHERE "users"."id" = 1